#   Задание 1

a = 15 * 3
b = 15 / 3
c = 15 // 2
d = 15 ** 2
print(type(a))
print(type(b))
print(type(c))
print(type(d))


# Задание проще некуда, а у меня вопрос возник)
# Вы сказали: "в четыре строчки за минуту", а меня смутило условие: выяснить тип РЕЗУЛЬТАТА
# Правильно было бы сделать:
#                           print(type(15 * 3))
#                           print(type(15 / 3))
#                           print(type(15 // 2))
#                           print(type(15 ** 2))  ?